app/controllers/school_classes_controller.rb

  def create
    byebug
    @school_class = SchoolClass.new
    @school_class.title = params[:school_class][:title]
    @school_class.room_number = params[:school_class][:room_number]
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "sabermetrics"], ["room_number", 2], ["created_at", "2020-11-10 22:21:49.986947"], ["updated_at", "2020-11-10 22:21:49.986947"]]